/* No comment provided by engineer. */
"AB_PERMISSION_MISSING_ACTION" = "امنح الوصول";

/* No comment provided by engineer. */
"AB_PERMISSION_MISSING_BODY" = "يحتاج Forsta للوصول إلى جهات الاتصال الخاصة بك. لن يتم تخزين جهات الاتصال الخاصة بك على خوادمنا.";

/* No comment provided by engineer. */
"AB_PERMISSION_MISSING_TITLE" = "عذرًا!";

/* Action sheet item */
"ACCEPT_NEW_IDENTITY_ACTION" = "Accept new safety numbers";

/* No comment provided by engineer. */
"ACTION_REQUIRED_TITLE" = "مطلوب اتخاذ إجراء";

/* No comment provided by engineer. */
"ADDRESSBOOK_RESTRICTED_ALERT_BODY" = "يتطلب Forsta الوصول إلى جهات الاتصال الخاصة بك، والوصول إلى جهات الاتصال مقيّد. سوف يتم إغلاق Forsta. يمكنك تعطيل ذلك القيد مؤقتًا للسماح بوصول Forsta إلى جهات الاتصال الخاصة بك عن طريق الذهاب إلى تطبيق الإعدادات >> عام >> القيود >> جهات الاتصال >> السماح بالتغييرات.";

/* No comment provided by engineer. */
"ADDRESSBOOK_RESTRICTED_ALERT_BUTTON" = "أغلق";

/* No comment provided by engineer. */
"ANSWER_CALL_BUTTON_TITLE" = "أجب";

/* No comment provided by engineer. */
"APN_FETCHED_FAILED" = "رسالة جديدة! فتح التطبيق لقراءتها";

/* No comment provided by engineer. */
"APN_Message" = "رسالة جديدة!";

/* No comment provided by engineer. */
"APN_MESSAGE_FROM" = "رسالة من";

/* No comment provided by engineer. */
"APN_MESSAGE_IN_GROUP" = "رسالة في المجموعة";

/* No comment provided by engineer. */
"APN_MESSAGE_IN_GROUP_DETAILED" = "%@ في المجموعة %@: %@";

/* Pressing this button moves a thread from the inbox to the archive */
"ARCHIVE_ACTION" = "Archive";

/* No comment provided by engineer. */
"ARCHIVE_NAV_BAR_TITLE" = "الأرشيف";

/* No comment provided by engineer. */
"ATTACHMENT" = "مرفقة";

/* No comment provided by engineer. */
"ATTACHMENT_DOWNLOAD_FAILED" = "لقد فشل تحميل المرفق، انقر لإعادة المحاولة.";

/* No comment provided by engineer. */
"ATTACHMENT_DOWNLOADING" = "جاري تنزيل الملحقات";

/* No comment provided by engineer. */
"ATTACHMENT_QUEUED" = "ملحق جديد في قائمة الانتظار قيد الإسترجاع.";

/* No comment provided by engineer. */
"AUDIO_PERMISSION_MESSAGE" = "تطبيق Forsta يتطلب إذن استخدام الميكروفون الخاص بجهازك للعمل بشكل صحيح. يمكنك إلغاء هذا الإذن من خلال تطبيق الإعدادات في جهازك >> الخصوصية >> الميكروفون >> Forsta";

/* No comment provided by engineer. */
"CALLBACK_BUTTON_TITLE" = "إعادة الإتصال";

/* No comment provided by engineer. */
"CHOOSE_MEDIA_BUTTON" = "اختر من المكتبة...";

/* No comment provided by engineer. */
"CONFIRM_ACCOUNT_DESTRUCTION_TEXT" = "هذا الإجراء سوف يعيد تعيين التطبيق بحذف الرسائل وإلغاء تسجيلك في الخادم. سيتم غلق التطبيق بعد حذف البيانات.";

/* No comment provided by engineer. */
"CONFIRM_ACCOUNT_DESTRUCTION_TITLE" = "هل أنت متأكد من أنك تريد حذف حسابك؟";

/* Alert body */
"CONFIRM_LEAVE_GROUP_DESCRIPTION" = "You will no longer be able to send or receive messages in this group.";

/* Alert title */
"CONFIRM_LEAVE_GROUP_TITLE" = "Do you really want to leave?";

/* Button text */
"CONFIRM_LINK_NEW_DEVICE_ACTION" = "Link New Device";

/* No comment provided by engineer. */
"CONFIRMATION_TITLE" = "تأكيد";

/* No comment provided by engineer. */
"CONTACT_DETAIL_COMM_TYPE_INSECURE" = "رقم غير مسجّل";

/* title for conversation settings screen */
"CONVERSATION_SETTINGS" = "Conversation Settings";

/* ActionSheet title */
"CORRUPTED_SESSION_DESCRIPTION" = "Resetting your session will allow you to receive future messages from %@, but it will not recover any already corrupted messages.";

/* No comment provided by engineer. */
"COUNTRYCODE_SELECT_TITLE" = "اختيار رمز الدولة";

/* {{number of days}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 days}}'. See other *_TIME_AMOUNT strings */
"DAYS_TIME_AMOUNT" = "%u days";

/* No comment provided by engineer. */
"DELIVERED_MESSAGE_TEXT" = "تم الإستلام";

/* {{Short Date}} when device last communicated with Forsta Server. */
"DEVICE_LAST_ACTIVE_AT_LABEL" = "Last active: %@";

/* {{Short Date}} when device was linked. */
"DEVICE_LINKED_AT_LABEL" = "Linked: %@";

/* Alert title that can occur when viewing device manager. */
"DEVICE_LIST_UPDATE_FAILED_TITLE" = "Failed to update device list.";

/* table cell label in conversation settings */
"DISAPPEARING_MESSAGES" = "Disappearing Messages";

/* subheading in conversation settings */
"DISAPPEARING_MESSAGES_DESCRIPTION" = "When enabled, messages sent and received in this conversation will disappear after they have been seen.";

/* Generic short text for button to dismiss a dialog */
"DISMISS_BUTTON_TEXT" = "Dismiss";

/* table cell label in conversation settings */
"EDIT_GROUP_ACTION" = "Edit Group";

/* Short name for edit menu item to save contents of media message. */
"EDIT_ITEM_SAVE_ACTION" = "Save";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_FIRST_TEXT" = "Tap on the compose button.";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_FIRST_TITLE" = "بدء أول محادثة باستخدام تطبيق Forsta!";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_TEXT" = "يمكنك أرشفة المحادثات غير النشطة لاحقاً من خلال صندوق الوارد.";

/* No comment provided by engineer. */
"EMPTY_ARCHIVE_TITLE" = "مسح المحادثات";

/* No comment provided by engineer. */
"EMPTY_CONTACTS_INVITE_BUTTON" = "ارسل دعوة إلى جهة اتصال";

/* No comment provided by engineer. */
"EMPTY_CONTACTS_LABEL_LINE1" = "لا يوجد مستخدمي تطبيق Forsta في قائمة الاتصال الخاصة بك";

/* No comment provided by engineer. */
"EMPTY_CONTACTS_LABEL_LINE2" = "لما لا تقوم بدعوة أحد؟";

/* No comment provided by engineer. */
"EMPTY_INBOX_FIRST_TEXT" = "لمحة: قم بإضافة محادثة كتذكرة";

/* No comment provided by engineer. */
"EMPTY_INBOX_FIRST_TITLE" = "تم. تم. تم.";

/* No comment provided by engineer. */
"EMPTY_INBOX_TEXT" = "صندوق الوارد خالي تماماً، يوماً سعيداً لك";

/* No comment provided by engineer. */
"EMPTY_INBOX_TITLE" = "خالٍ تماماً";

/* No comment provided by engineer. */
"END_CALL_BAD_INTERACTION_WITH_SERVER" = "حصل عطب في خادم البيانات!";

/* No comment provided by engineer. */
"END_CALL_BUTTON_TITLE" = "نهاية";

/* No comment provided by engineer. */
"END_CALL_HANDSHAKE_FAILED" = "حصلت مشكلة في الاتصال !";

/* No comment provided by engineer. */
"END_CALL_HANGUP_LOCAL" = "لقد أنهيت المكالمة.";

/* No comment provided by engineer. */
"END_CALL_HANGUP_REMOTE" = "تمّ إنهاء المكالمة من الطّرف الآخر.";

/* No comment provided by engineer. */
"END_CALL_LOGIN_FAILED" = "فشل تسجيل الدخول!";

/* No comment provided by engineer. */
"END_CALL_MESSAGE_FROM_SERVER_PREFIX" = "رسالة من الخادم:";

/* No comment provided by engineer. */
"END_CALL_NO_SUCH_USER" = "الرقم غير مسجلّ مع تطبيق Forsta أو تطبيق RedPhone!";

/* No comment provided by engineer. */
"END_CALL_RECIPIENT_UNAVAILABLE" = "المتصل به غير متاح.";

/* No comment provided by engineer. */
"END_CALL_REJECTED_LOCAL" = "لقد رفضت المكالمة.";

/* No comment provided by engineer. */
"END_CALL_REJECTED_REMOTE" = "تم رفض المكالمة.";

/* No comment provided by engineer. */
"END_CALL_REPLACED_BY_NEXT" = "لقد قمت باتصال اخر.";

/* No comment provided by engineer. */
"END_CALL_RESPONDER_IS_BUSY" = "مشغول...";

/* No comment provided by engineer. */
"END_CALL_STALE_SESSION" = "المكالمة التى لم يرد عليها.";

/* No comment provided by engineer. */
"END_CALL_UNCATEGORIZED_FAILURE" = "فشل التطبيق!";

/* Generic notice when message failed to send. */
"ERROR_DESCRIPTION_CLIENT_SENDING_FAILURE" = "Failed to send message.";

/* Generic error used whenver Forsta can't contact the server */
"ERROR_DESCRIPTION_NO_INTERNET" = "Forsta was unable to connect to the internet. Please try from another WiFi network or use mobile data.";

/* Generic server error */
"ERROR_DESCRIPTION_SERVER_FAILURE" = "Server Error. Please try again later.";

/* Error message when attempting to send message */
"ERROR_DESCRIPTION_UNREGISTERED_RECIPIENT" = "Recipient is no longer a Forsta user.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_DUPLICATE_MESSAGE" = "تم تلقي رسالة مكررة.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_INVALID_KEY_EXCEPTION" = "المفتاح الخاص بالمستلم غير صالح.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_INVALID_MESSAGE" = "Received a badly encrypted message. Tap to reset your secure session.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_INVALID_VERSION" = "لقد تلقيت رسالة غير متوافقة مع هذه النسخة من التطبيق.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_NO_SESSION" = "لا توجد دورة اتصال";

/* No comment provided by engineer. */
"ERROR_MESSAGE_NON_BLOCKING_IDENTITY_CHANGE" = "Safety numbers changed.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_UNKNOWN_ERROR" = "حدث خطأ غير معروف.";

/* No comment provided by engineer. */
"ERROR_MESSAGE_WRONG_TRUSTED_IDENTITY_KEY" = "Safety numbers changed. Tap to verify.";

/* No comment provided by engineer. */
"ERROR_WAS_DETECTED_TITLE" = "مشكله!";

/* action sheet header when re-sending message which failed because of too many attempts */
"FAILED_SENDING_BECAUSE_RATE_LIMIT" = "Too many failures with this contact. Please try again shortly.";

/* action sheet header when re-sending message which failed because of untrusted identity keys */
"FAILED_SENDING_BECAUSE_UNTRUSTED_IDENTITY_KEY" = "You must accept their new safety numbers before you will be able to send.";

/* No comment provided by engineer. */
"FAILED_SENDING_TEXT" = "لم تنجح عملية الإرسال. انقر لإعادة المحاولة.";

/* alert title */
"FAILED_VERIFICATION_TITLE" = "Failed to Verify Safety Numbers!";

/* No comment provided by engineer. */
"FINGERPRINT_SHRED_KEYMATERIAL_BUTTON" = "إعادة تعيين هذه الجلسة.";

/* No comment provided by engineer. */
"GROUP_AVATAR_CHANGED" = "تغيرت الصورة الرمزية.";

/* No comment provided by engineer. */
"GROUP_CREATED" = "Group created.";

/* No comment provided by engineer. */
"GROUP_CREATING" = "Creating new group";

/* No comment provided by engineer. */
"GROUP_CREATING_FAILED" = "Group creation failed";

/* Conversation settings table section title */
"GROUP_MANAGEMENT_SECTION" = "Group Management";

/* No comment provided by engineer. */
"GROUP_MEMBER_JOINED" = "%@ انضم إلى المجموعة";

/* No comment provided by engineer. */
"GROUP_MEMBER_LEFT" = "%@ غادر المجموعة";

/* header for table which lists the members of this group thread */
"GROUP_MEMBERS_HEADER" = "Group Members";

/* No comment provided by engineer. */
"GROUP_REMOVING" = "Leaving group %@";

/* No comment provided by engineer. */
"GROUP_REMOVING_FAILED" = "Failed to leave group";

/* No comment provided by engineer. */
"GROUP_TITLE_CHANGED" = "الآن أصبح العنوان %@";

/* No comment provided by engineer. */
"GROUP_UPDATED" = "تم تحديث المجموعة.";

/* No comment provided by engineer. */
"GROUP_YOU_LEFT" = "لقد غادرت المجموعة";

/* {{number of hours}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 hours}}'. See other *_TIME_AMOUNT strings */
"HOURS_TIME_AMOUNT" = "%u hours";

/* Call setup status label */
"IN_CALL_CONNECTING" = "جاري الربط...";

/* Call setup status label */
"IN_CALL_RINGING" = "رنين...";

/* Call setup status label */
"IN_CALL_SECURING" = "تم الرد. جاري التأمين...";

/* Call setup status label */
"IN_CALL_TALKING" = "آمن. فعال.";

/* Call setup status label */
"IN_CALL_TERMINATED" = "تم.";

/* No comment provided by engineer. */
"INCOMING_CALL" = "مكالمة واردة";

/* No comment provided by engineer. */
"INCOMING_CALL_FROM" = "مكالمة واردة من %@";

/* Slider label embeds {{TIME_AMOUNT}}, e.g. '2 hours'. See *_TIME_AMOUNT strings for examples. */
"KEEP_MESSAGES_DURATION" = "Messages disappear after %@.";

/* Slider label when disappearing messages is off */
"KEEP_MESSAGES_FOREVER" = "Messages do not disappear.";

/* Confirmation button within contextual alert */
"LEAVE_BUTTON_TITLE" = "غادر";

/* table cell label in conversation settings */
"LEAVE_GROUP_ACTION" = "Leave Group";

/* report an invalid linking code */
"LINK_DEVICE_INVALID_CODE_BODY" = "This QR code is not valid, make sure you are scanning the QR code displayed on the device you want to link.";

/* report an invalid linking code */
"LINK_DEVICE_INVALID_CODE_TITLE" = "Linking Device Failed";

/* confirm the users intent to link a new device */
"LINK_DEVICE_PERMISSION_ALERT_BODY" = "This device will be able to see your groups and contacts, read all your messages, and send messages in your name.";

/* confirm the users intent to link a new device */
"LINK_DEVICE_PERMISSION_ALERT_TITLE" = "Link this device?";

/* attempt another linking */
"LINK_DEVICE_RESTART" = "Retry";

/* QR Scanning screen instructions, placed alongside a camera view for scanning QRCodes */
"LINK_DEVICE_SCANNING_INSTRUCTIONS" = "Scan the QR code displayed on the device to link.";

/* Subheading for 'Link New Device' navigation */
"LINK_NEW_DEVICE_SUBTITLE" = "Scan QR Code";

/* Navigation title when scanning QR code to add new device. */
"LINK_NEW_DEVICE_TITLE" = "Link New Device";

/* Menu item and navbar title for the device manager */
"LINKED_DEVICES_TITLE" = "Linked Devices";

/* Alert Title */
"LINKING_DEVICE_FAILED_TITLE" = "Linking Device Failed";

/* table cell label in conversation settings */
"LIST_GROUP_MEMBERS_ACTION" = "List Group Members";

/* No comment provided by engineer. */
"LOADING_CONTACTS_LABEL_LINE1" = "تحميل قائمة الإتصال الخاصة بك";

/* No comment provided by engineer. */
"LOADING_CONTACTS_LABEL_LINE2" = "اثبت مكانك.";

/* No comment provided by engineer. */
"LOGGING_SECTION" = "التسجيل";

/* No comment provided by engineer. */
"ME_STRING" = "أنا";

/* No comment provided by engineer. */
"MESSAGE_COMPOSEVIEW_TITLE" = "رسالة جديدة";

/* {{number of minutes}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 minutes}}'. See other *_TIME_AMOUNT strings */
"MINUTES_TIME_AMOUNT" = "%u minutes";

/* No comment provided by engineer. */
"MISSED_CALL" = "مكالمة فائتة";

/* Alert body */
"MISSING_CAMERA_PERMISSION_MESSAGE" = "You previously declined to let Forsta access your camera. Update your system settings to proceed.";

/* Alert title */
"MISSING_CAMERA_PERMISSION_TITLE" = "Forsta needs to access your camera.";

/* No comment provided by engineer. */
"MSGVIEW_MISSED_CALL" = "مكالمة فائتة من %@";

/* No comment provided by engineer. */
"MSGVIEW_RECEIVED_CALL" = "مكالمة واردة من %@";

/* No comment provided by engineer. */
"MSGVIEW_YOU_CALLED" = "لقد اتصلت ب %@";

/* No comment provided by engineer. */
"MULTIDEVICE_PAIRING_MAX_DESC" = "You can not pair any more devices.";

/* No comment provided by engineer. */
"MULTIDEVICE_PAIRING_MAX_RECOVERY" = "You have reached the maximum of devices you can currently pair with your account. Please remove a device or try again to pair it later.";

/* No comment provided by engineer. */
"NETWORK_ERROR_RECOVERY" = "Please check you're online and try again.";

/* No comment provided by engineer. */
"NETWORK_STATUS_CONNECTED" = "متصل";

/* No comment provided by engineer. */
"NETWORK_STATUS_CONNECTING" = "جاري الاتصال";

/* No comment provided by engineer. */
"NETWORK_STATUS_HEADER" = "حالة الشبكة";

/* No comment provided by engineer. */
"NETWORK_STATUS_OFFLINE" = "غير متواجد حالياً";

/* No comment provided by engineer. */
"NETWORK_STATUS_TEXT" = "يمكنك التأكد من حالة الشبكة من خلال الشريط الملون أعلى صندوق الوارد";

/* No comment provided by engineer. */
"NEW_GROUP_DEFAULT_TITLE" = "مجموعة جديدة";

/* No comment provided by engineer. */
"NEW_GROUP_NAMEGROUP_REQUEST_DEFAULT" = "تحديد اسم للمجموعة";

/* No comment provided by engineer. */
"NEW_GROUP_REQUEST_ADDPEOPLE" = "إضافة أشخاص";

/* No comment provided by engineer. */
"NOTIFICATION_SEND_FAILED" = "فشل إرسال رسالتك إلى %@.";

/* No comment provided by engineer. */
"NOTIFICATIONS_FOOTER_WARNING" = "بسبب وجودد بعض الأعطاب المعروفة في إطار الإشعارات الخاص بأبل, سيتم إظهار الإشعارات فقط في حالة إستقبال الرسائل خلال 30 ثانية من إرسالها. فلربما يكون هناك عدم دقة في منظومة الإشعارات.";

/* No comment provided by engineer. */
"NOTIFICATIONS_NONE" = "عدم إظهار اسم المرسل او الرسالة";

/* No comment provided by engineer. */
"NOTIFICATIONS_SECTION_BACKGROUND" = "إشعارات الخلفية";

/* No comment provided by engineer. */
"NOTIFICATIONS_SECTION_INAPP" = "إشعارات خلال التطبيق";

/* No comment provided by engineer. */
"NOTIFICATIONS_SENDER_AND_MESSAGE" = "إظهار اسم المرسل والرسالة";

/* No comment provided by engineer. */
"NOTIFICATIONS_SENDER_ONLY" = "إظهار اسم المرسل فقط";

/* No comment provided by engineer. */
"NOTIFICATIONS_SHOW" = "عرض";

/* No comment provided by engineer. */
"NOTIFICATIONS_SOUND" = "صوت الإشعارات";

/* No comment provided by engineer. */
"OK" = "حسنا";

/* Button text which opens the settings app */
"OPEN_SETTINGS_BUTTON" = "Settings";

/* Info Message when {{other user}} disables or doesn't support disappearing messages */
"OTHER_DISABLED_DISAPPEARING_MESSAGES_CONFIGURATION" = "%@ disabled disappearing messages.";

/* Info Message when {{other user}} updates message expiration to {{time amount}}, see the *_TIME_AMOUNT strings for context. */
"OTHER_UPDATED_DISAPPEARING_MESSAGES_CONFIGURATION" = "%@ set disappearing message time to %@.";

/* No comment provided by engineer. */
"OUTGOING_CALL" = "مكالمة صادرة";

/* No comment provided by engineer. */
"PHONE_NEEDS_UNLOCK" = "يجب فتح قفل الجهاز لإستلام رسالة جديدة.";

/* Alert body when verifying with {{contact name}} */
"PRIVACY_VERIFICATION_FAILED_I_HAVE_WRONG_KEY_FOR_THEM" = "Those don't look like the safety numbers for %@. Are you verifying the correct contact?";

/* Alert body when verifying with {{contact name}} */
"PRIVACY_VERIFICATION_FAILED_THEY_HAVE_WRONG_KEY_FOR_ME" = "Every pair of Forsta users shares distinct safety numbers. Double check that %@ is displaying *your* distinct safety numbers.";

/* alert body */
"PRIVACY_VERIFICATION_FAILED_WITH_OLD_LOCAL_VERSION" = "You're running an old version of Forsta. You need to update before you can verify.";

/* alert body */
"PRIVACY_VERIFICATION_FAILED_WITH_OLD_REMOTE_VERSION" = "Your partner is running an old version of Forsta. They need to update before you can verify.";

/* alert body */
"PRIVACY_VERIFICATION_FAILURE_INVALID_QRCODE" = "The scanned code doesn't look like a safety number code. Are you both on an up-to-date version of Forsta?";

/* Paragraph(s) shown alongside keying material when verifying privacy with {{contact name}} */
"PRIVACY_VERIFICATION_INSTRUCTIONS" = "If you wish to verify the security of your end-to-end encryption with %@, compare the numbers above with the numbers on their device.\n\nAlternatively, you can scan the code on their phone, or ask them to scan your code.";

/* Navbar title */
"PRIVACY_VERIFICATION_TITLE" = "Verify Safety Numbers";

/* No comment provided by engineer. */
"PROCEED_BUTTON" = "تقدم";

/* No comment provided by engineer. */
"PUSH_MANAGER_MARKREAD" = "تعليمها ب \"مقروءة\"";

/* No comment provided by engineer. */
"PUSH_MANAGER_REPLY" = "رُد";

/* Alert title */
"PUSH_REGISTER_SUCCESS" = "Successfully re-registered for push notifications.";

/* Used in table section header and alert view title contexts */
"PUSH_REGISTER_TITLE" = "الإشعارات اللحظية";

/* No comment provided by engineer. */
"PUSH_SETTINGS_MESSAGE" = "يتطلب تطبيق Forsta تفعيل الإشعارات والأصوات للعمل بشكل صحيح. برجاء التفعيل من خلال تطبيق الإعدادات >> الإشعارات >> Forsta";

/* No comment provided by engineer. */
"QUESTIONMARK_PUNCTUATION" = "؟";

/* No comment provided by engineer. */
"RATING_MSG" = "إذا كنت تتمتع باستخدام Forsta لإجراء محادثات خاصة، يمكنك دعم مشروعنا عن طريق تقييمه. لن يستغرق هذا أكثر من دقيقة واحدة، وسوف يساعد الآخرين في العثور على بعض الخصوصية.";

/* No comment provided by engineer. */
"RATING_RATE" = "قيّم Forsta";

/* No comment provided by engineer. */
"RATING_TITLE" = "ادعم Forsta!";

/* No comment provided by engineer. */
"REGISTER_CC_ERR_ALERT_VIEW_MESSAGE" = "يرجى إدخال رمز دولي صحيح";

/* No comment provided by engineer. */
"REGISTER_CC_ERR_ALERT_VIEW_TITLE" = "خطأ في رمز الدولة";

/* No comment provided by engineer. */
"REGISTER_CONTACTS_BODY" = "يسمح لك Forsta بإجراء محادثات خاصة مع جهات الاتصال الموجودة لديك. للبدء في استخدام Forsta، نرجو السماح بالوصول إلى جهات الاتصال الخاصة بك.";

/* No comment provided by engineer. */
"REGISTER_CONTACTS_CONTINUE" = "تابع";

/* No comment provided by engineer. */
"REGISTER_CONTACTS_WELCOME" = "مرحبًا!";

/* No comment provided by engineer. */
"REGISTER_FAILED_TRY_AGAIN" = "حاول مرة أخرى";

/* No comment provided by engineer. */
"REGISTER_RATE_LIMITING_BODY" = "جهاز الخادم في مرحلة اشتراك محدود، يرجى المحاولة في ما بعد.";

/* No comment provided by engineer. */
"REGISTERED_NUMBER_TEXT" = "Registered Number";

/* Alert title */
"REGISTRATION_BODY" = "Failed to re-register for push notifications.";

/* No comment provided by engineer. */
"REGISTRATION_DEFAULT_COUNTRY_NAME" = "رمز البلد";

/* No comment provided by engineer. */
"REGISTRATION_ENTERNUMBER_DEFAULT_TEXT" = "قم بإدخال الرقم";

/* No comment provided by engineer. */
"REGISTRATION_ERROR" = "خطأ في التسجيل";

/* alert body during registration */
"REGISTRATION_ERROR_BLANK_VERIFICATION_CODE" = "We can't activate your account until you verify the code we sent you.";

/* No comment provided by engineer. */
"REGISTRATION_NON_VALID_NUMBER" = "This phone number format is not supported, please contact support.";

/* No comment provided by engineer. */
"REGISTRATION_PHONENUMBER_BUTTON" = "رقم الهاتف";

/* No comment provided by engineer. */
"REGISTRATION_RESTRICTED_MESSAGE" = "Someone's excited to send their first message! You need to register before performing this action.";

/* No comment provided by engineer. */
"REGISTRATION_TITLE_LABEL" = "رقم هاتفك";

/* Alert view title */
"REGISTRATION_VERIFICATION_FAILED_TITLE" = "Verification Failed";

/* Alert body, during registration */
"REGISTRATION_VERIFICATION_FAILED_WRONG_CODE_DESCRIPTION" = "The numbers you submitted don't match what we sent. Want to double check?";

/* No comment provided by engineer. */
"REGISTRATION_VERIFY_DEVICE" = "التحقق من هذا الجهاز";

/* No comment provided by engineer. */
"REJECT_CALL_BUTTON_TITLE" = "رفض";

/* No comment provided by engineer. */
"RELAY_REGISTERED_ERROR_RECOVERY" = "The phone number you are trying to register has already been registered on another server, please unregister from there and try again.";

/* No comment provided by engineer. */
"REREGISTER_FOR_PUSH" = "إعادة الإشتراك في خدمة الإشعارات اللحظية";

/* Generic text for button that retries whatever the last action was. */
"RETRY_BUTTON_TEXT" = "Retry";

/* Snippet to share {{safety numbers}} with a friend. sent e.g. via sms */
"SAFETY_NUMBER_SHARE_FORMAT" = "Our Forsta Safety Numbers:\n%@";

/* Action sheet heading */
"SAFETY_NUMBERS_ACTIONSHEET_TITLE" = "The safety numbers for %@ have changed. You may wish to verify them.";

/* Button label presented with camera icon while verifying privacy credentials. Shows the camera interface. */
"SCAN_CODE_ACTION" = "Scan Code";

/* label presented once scanning (camera) view is visible. */
"SCAN_CODE_INSTRUCTIONS" = "Scan the QR Code on your contact's device.";

/* No comment provided by engineer. */
"SEARCH_BYNAMEORNUMBER_PLACEHOLDER_TEXT" = "بحث باستخدام الاسم أو الرقم";

/* {{number of seconds}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 seconds}}'. See other *_TIME_AMOUNT strings */
"SECONDS_TIME_AMOUNT" = "%u seconds";

/* No comment provided by engineer. */
"SECURE_SESSION_RESET" = "لقد تم إعادة تعيين دورة الاتصال الآمنة";

/* No comment provided by engineer. */
"SEND_AGAIN_BUTTON" = "قم بالإرسال مرة أخرى";

/* No comment provided by engineer. */
"SEND_BUTTON_TITLE" = "إرسال";

/* No comment provided by engineer. */
"SEND_SMS_BUTTON" = "ارسل رسالة نصية إلى:";

/* No comment provided by engineer. */
"SEND_SMS_CONFIRM_TITLE" = "إرسال دعوة لصديق عن طريق رسالة نصية غير آمنة؟";

/* No comment provided by engineer. */
"SEND_SMS_INVITE_FAILURE" = "لم نتمكن من  إرسال الرسالة النصية، يرجى إعادة المحاولة في وقت لاحق.";

/* No comment provided by engineer. */
"SEND_SMS_INVITE_SUCCESS" = "لقد قمت بدعوة صديقك لاستخدام تطبيق Forsta!";

/* No comment provided by engineer. */
"SEND_SMS_INVITE_TITLE" = "هل ترغب في إرسال دعوة لتطبيق Forsta إلى الرقم التالي:";

/* No comment provided by engineer. */
"SETTINGS_ABOUT" = "حول";

/* No comment provided by engineer. */
"SETTINGS_ADVANCED_DEBUGLOG" = "تفعيل سجل التصحيح";

/* No comment provided by engineer. */
"SETTINGS_ADVANCED_SUBMIT_DEBUGLOG" = "تقديم سجل التصحيح";

/* No comment provided by engineer. */
"SETTINGS_ADVANCED_TITLE" = "إعدادات متقدمة";

/* User settings section footer, a detailed explanation */
"SETTINGS_BLOCK_ON_IDENITY_CHANGE_DETAIL" = "Requires your approval before communicating with someone who has new safety numbers, commonly from a reinstall of Forsta.";

/* Table cell label */
"SETTINGS_BLOCK_ON_IDENTITY_CHANGE_TITLE" = "Require Approval on Change";

/* No comment provided by engineer. */
"SETTINGS_CLEAR_HISTORY" = "امسح سجل التاريخ";

/* No comment provided by engineer. */
"SETTINGS_COPYRIGHT" = "حقوق النشر محفوظة ل Forsta, Open Whisper Systems\n المرخصة بموجب ترخيص GPLv3";

/* No comment provided by engineer. */
"SETTINGS_DELETE_ACCOUNT_BUTTON" = "حذف حسابك";

/* No comment provided by engineer. */
"SETTINGS_DELETE_HISTORYLOG_CONFIRMATION" = "هل أنت متأكد أنك تريد حذف كل سجل التاريخ الخاص بك (الرسائل، الملحقات، سجل الاتصالات ...)؟ هذا الإجراء لا يمكن الرجوع فيه.";

/* No comment provided by engineer. */
"SETTINGS_DELETE_HISTORYLOG_CONFIRMATION_BUTTON" = "أنا متأكد";

/* No comment provided by engineer. */
"SETTINGS_HELP_HEADER" = "مساعدة";

/* Section header */
"SETTINGS_HISTORYLOG_TITLE" = "سجل التاريخ";

/* No comment provided by engineer. */
"SETTINGS_INFORMATION_HEADER" = "معلومات";

/* No comment provided by engineer. */
"SETTINGS_INVITE_HEADER" = "توجيه دعوة";

/* No comment provided by engineer. */
"SETTINGS_INVITE_TWITTER_TEXT" = "You can reach me using Forsta by @forstainc, get it now.";

/* Title for settings activity */
"SETTINGS_NAV_BAR_TITLE" = "الإعدادات";

/* No comment provided by engineer. */
"SETTINGS_NOTIFICATIONS" = "الإشعارات";

/* No comment provided by engineer. */
"SETTINGS_PRIVACY_TITLE" = "الخصوصية";

/* Section header */
"SETTINGS_PRIVACY_VERIFICATION_TITLE" = "Safety Numbers Approval";

/* No comment provided by engineer. */
"SETTINGS_SCREEN_SECURITY" = "تفعيل خاصية تأمين الشاشة";

/* No comment provided by engineer. */
"SETTINGS_SCREEN_SECURITY_DETAIL" = "Prevents Forsta previews from appearing in the app switcher.";

/* Section header */
"SETTINGS_SECURITY_TITLE" = "تأمين الشاشة";

/* No comment provided by engineer. */
"SETTINGS_SHARE_INSTALL" = "مشاركة رابط التثبيت";

/* No comment provided by engineer. */
"SETTINGS_SUPPORT" = "الدعم";

/* No comment provided by engineer. */
"SETTINGS_VERSION" = "النسخة";

/* Action sheet item */
"SHOW_SAFETY_NUMBER_ACTION" = "Show new safety numbers";

/* {{1 day}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 day}}'. See other *_TIME_AMOUNT strings */
"SINGLE_DAY_TIME_AMOUNT" = "%u day";

/* {{1 hour}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 hour}}'. See other *_TIME_AMOUNT strings */
"SINGLE_HOUR_TIME_AMOUNT" = "%u hour";

/* {{1 minute}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 minute}}'. See other *_TIME_AMOUNT strings */
"SINGLE_MINUTE_TIME_AMOUNT" = "%u minute";

/* {{1 week}} embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{1 week}}'. See other *_TIME_AMOUNT strings */
"SINGLE_WEEK_TIME_AMOUNT" = "%u week";

/* No comment provided by engineer. */
"SMS_INVITE_BODY" = "أنا ادعُك لتثبيت تطبيق Forsta، ها هو الرابط:";

/* Alert body after verifying privacy with {{other user's name}} */
"SUCCESSFUL_VERIFICATION_DESCRIPTION" = "Your safety numbers have been verified. You can be confident your communication with %@ is private.";

/* No comment provided by engineer. */
"SUCCESSFUL_VERIFICATION_TITLE" = "Safety Numbers Verified!";

/* No comment provided by engineer. */
"TAKE_MEDIA_BUTTON" = "التقت صورة أو فيديو";

/* No comment provided by engineer. */
"TAKE_PICTURE_BUTTON" = "التقت صورة";

/* No comment provided by engineer. */
"TIMEOUT_CONTACTS_DETAIL" = "لم نتمكن من جلب قائمة جهات الاتصال المحدثة من الخادم. يرجى المحاولة مرة أخرى في وقت لاحق.";

/* No comment provided by engineer. */
"TXT_CANCEL_TITLE" = "إلغاء";

/* No comment provided by engineer. */
"TXT_DELETE_TITLE" = "حذف";

/* Pressing this button moves an archived thread from the archive back to the inbox */
"UNARCHIVE_ACTION" = "Unarchive";

/* In Inbox view, last message label for thread with corrupted attachment. */
"UNKNOWN_ATTACHMENT_LABEL" = "Unknown attachment";

/* Displayed if for some reason we can't determine a contacts phone number *or* name */
"UNKNOWN_CONTACT_NAME" = "Unknown Contact";

/* button title for unlinking a device */
"UNLINK_ACTION" = "Unlink";

/* Alert message to confirm unlinking a device */
"UNLINK_CONFIRMATION_ALERT_BODY" = "By unlinking this device, it will no longer be able to send or receive messages.";

/* Alert title for confirming device deletion */
"UNLINK_CONFIRMATION_ALERT_TITLE" = "Unlink \"%@\"?";

/* Alert title when unlinking device fails */
"UNLINKING_FAILED_ALERT_TITLE" = "Forsta was unable to unlink your device.";

/* Label text in device manager for a device with no name */
"UNNAMED_DEVICE" = "Unnamed Device";

/* No comment provided by engineer. */
"UNREGISTER_SIGNAL_FAIL" = "Failed to unregister from Forsta.";

/* No comment provided by engineer. */
"UNSUPPORTED_ATTACHMENT" = "تم تلقى ملحقة من نوعية غير معتمد";

/* No comment provided by engineer. */
"UNSUPPORTED_FEATURE_ERROR" = "جهازك لا يدعم هذه الخاصية";

/* No comment provided by engineer. */
"UPDATE_BUTTON_TITLE" = "تحديث";

/* No comment provided by engineer. */
"Upgrading Forsta ..." = "Upgrading Forsta ...";

/* message footer while attachment is uploading */
"UPLOADING_MESSAGE_TEXT" = "Uploading...";

/* button text during registration to make corrections to your submitted phone number */
"VERIFICATION_CHALLENGE_CHANGE_NUMBER" = "تغيير الرقم";

/* Text field placeholder for SMS verification code during registration */
"VERIFICATION_CHALLENGE_DEFAULT_TEXT" = "رمز التحقق";

/* button text during registration to request phone number verification be done via phone call */
"VERIFICATION_CHALLENGE_SEND_VIAVOICE" = "اتصل بي بدلا من ذلك";

/* button text during registration to request another SMS code be sent */
"VERIFICATION_CHALLENGE_SUBMIT_AGAIN" = "إعادة طلب الرمز";

/* button text during registration to submit your SMS verification code */
"VERIFICATION_CHALLENGE_SUBMIT_CODE" = "تقديم رمز التحقق";

/* Navigation title in the registration flow - during the sms code verification process. */
"VERIFICATION_HEADER" = "تحقق";

/* table cell label in conversation settings */
"VERIFY_PRIVACY" = "Verify Safety Numbers";

/* Activity indicator title, shown upon returning to the device manager, until you complete the provisioning process on desktop */
"WAITING_TO_COMPLETE_DEVICE_LINK_TEXT" = "Complete setup on Forsta Desktop.";

/* {{number of weeks}}, embedded in strings, e.g. 'Alice updated disappearing messages expiration to {{5 weeks}}'. See other *_TIME_AMOUNT strings */
"WEEKS_TIME_AMOUNT" = "%u weeks";

/* No comment provided by engineer. */
"WHISPER_NAV_BAR_TITLE" = "البريد الوارد";

/* Info Message when you disable disappearing messages */
"YOU_DISABLED_DISAPPEARING_MESSAGES_CONFIGURATION" = "You disabled disappearing messages.";

/* Info message embedding a {{time amount}}, see the *_TIME_AMOUNT strings for context. */
"YOU_UPDATED_DISAPPEARING_MESSAGES_CONFIGURATION" = "You set disappearing message time to %@.";
